In [47]:
import pandas as pd

In [48]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [49]:
df1 = pd.DataFrame(data = data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [50]:
index = ['Linha ' + str(i) for i in range(3)]
index

['Linha 0', 'Linha 1', 'Linha 2']

In [51]:
df1 = pd.DataFrame(data = data, index = index)
df1

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [52]:
columns = ['Coluna ' + str(i) for i in range(3)]
columns

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [53]:
df2 = pd.DataFrame(data = data, index = index, columns = columns)
df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [54]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [55]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [56]:
df1[df1 > 0] = 'A'
df1

         0  1  2
Linha 0  A  A  A
Linha 1  A  A  A
Linha 2  A  A  A

In [57]:
df2[df2 > 0] = 'B'
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [58]:
df3[df3 > 0] = 'C'
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0      NaN      NaN      NaN
Linha 1      NaN      NaN      NaN
Linha 2      NaN      NaN      NaN

In [59]:
df4 = pd.concat([df1, df2, df3])
df4

           0    1    2 Coluna 0 Coluna 1 Coluna 2
Linha 0    A    A    A      NaN      NaN      NaN
Linha 1    A    A    A      NaN      NaN      NaN
Linha 2    A    A    A      NaN      NaN      NaN
Linha 0  NaN  NaN  NaN        B        B        B
Linha 1  NaN  NaN  NaN        B        B        B
Linha 2  NaN  NaN  NaN        B        B        B
Linha 0  NaN  NaN  NaN      NaN      NaN      NaN
Linha 1  NaN  NaN  NaN      NaN      NaN      NaN
Linha 2  NaN  NaN  NaN      NaN      NaN      NaN

# DataFrame

In [60]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [61]:
df1 = pd.DataFrame(data = data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [62]:
index = ['Linha ' + str(i) for i in range(3)]
index

['Linha 0', 'Linha 1', 'Linha 2']

In [63]:
df1 = pd.DataFrame(data = data, index = index)
df1

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [64]:
columns = ['Coluna ' + str(i) for i in range(3)]
columns

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [65]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [66]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [67]:
df2 = pd.DataFrame(data)

In [68]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [69]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [70]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [71]:
df1[df1 > 0] = 'A'
df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [72]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [73]:
df2[df3 > 0] = 'C'
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [74]:
df4 = pd.concat([df1, df2, df3])
df4

        Coluna 0 Coluna 1 Coluna 2 Coluna0 Coluna1 Coluna2
Linha 0        A        A        A     NaN     NaN     NaN
Linha 1        A        A        A     NaN     NaN     NaN
Linha 2        A        A        A     NaN     NaN     NaN
Linha0       NaN      NaN      NaN       B       B       B
Linha1       NaN      NaN      NaN       B       B       B
Linha2       NaN      NaN      NaN       B       B       B
Linha 0        1        2        3     NaN     NaN     NaN
Linha 1        4        5        6     NaN     NaN     NaN
Linha 2        7        8        9     NaN     NaN     NaN